---
kind: other
id: Methods.T:Autodesk.Revit.DB.DeleteElements
source: html/b4468c64-907f-b19b-f50c-6ffcbd909a95.htm
---
# DeleteElements Methods

Creates an instance of the DeleteElements resolution.